Simulators/simulator/firmware/Arduino/hardware/simulators/avr/boards.txt
# Consolidated boards.txt for all Liverpool Ringing Simulator boards
#
###########################################################################
# Mk1 Hardware is a complete Uno R3
simulatormk1.name=Simulator Mk1 ICSP (16MHz External Clock - No Bootloader)
# Upload
simulatormk1.upload.using=arduino:arduinoisp
simulatormk1.upload.maximum_size=32768
simulatormk1.upload.tool=arduino:avrdude
# Bootload
simulatormk1.bootloader.low_fuses=0xFF
simulatormk1.bootloader.high_fuses=0xD6
simulatormk1.bootloader.extended_fuses=0x05
simulatormk1.bootloader.tool=arduino:avrdude
simulatormk1.bootloader.file=optiboot_atmega328.hex
simulatormk1.bootloader.unlock_bits=0x3F
simulatormk1.bootloader.lock_bits=0x0F
# Build
simulatormk1.build.mcu=atmega328p
simulatormk1.build.f_cpu=16000000L
simulatormk1.build.core=arduino:arduino
simulatormk1.build.variant=arduino:standard

###########################################################################
# Mk2 Hardware is the ATMega328p stripboard build
simulatormk2.name=Simulator Mk2 ICSP (8MHz Internal Clock - No Bootloader)
# Upload
simulatormk2.upload.using=arduino:arduinoisp
simulatormk2.upload.maximum_size=32768
simulatormk2.upload.tool=arduino:avrdude
# Bootload
simulatormk2.bootloader.low_fuses=0xE2
simulatormk2.bootloader.high_fuses=0xD6
simulatormk2.bootloader.extended_fuses=0x07
simulatormk2.bootloader.tool=arduino:avrdude
simulatormk2.bootloader.file=optiboot_atmega328.hex
simulatormk2.bootloader.unlock_bits=0x3F
simulatormk2.bootloader.lock_bits=0x3F
# Build
simulatormk2.build.mcu=atmega328p
simulatormk2.build.f_cpu=8000000L
simulatormk2.build.core=arduino:arduino
simulatormk2.build.variant=arduino:standard

###########################################################################
# Simulator Interface Board - HW Rev B
simulator.name=Simulator Interface Board (ICSP)
# Upload
simulator.upload.using=arduino:arduinoisp
simulator.upload.maximum_size=32768
simulator.upload.tool=arduino:avrdude
# Bootload
simulator.bootloader.low_fuses=0xE2
simulator.bootloader.high_fuses=0xD7
simulator.bootloader.extended_fuses=0x05
simulator.bootloader.tool=arduino:avrdude
simulator.bootloader.file=optiboot_atmega328.hex
simulator.bootloader.unlock_bits=0x3F
simulator.bootloader.lock_bits=0x3F
# Build
simulator.build.mcu=atmega328p
## Alternative mcu
##simulator.build.mcu=atmega328
simulator.build.f_cpu=8000000L
simulator.build.core=arduino:arduino
simulator.build.variant=arduino:standard

###########################################################################
# Splitter Box - Functional Prototype HW Rev 1
splitter.name=Prototype Splitter Box Board (ICSP)
# Upload
splitter.upload.using=arduino:arduinoisp
splitter.upload.maximum_size=32768
splitter.upload.tool=arduino:avrdude
# Bootload
splitter.bootloader.low_fuses=0xE2
splitter.bootloader.high_fuses=0xD7
splitter.bootloader.extended_fuses=0x05
splitter.bootloader.tool=arduino:avrdude
splitter.bootloader.file=optiboot_atmega328.hex
splitter.bootloader.unlock_bits=0x3F
splitter.bootloader.lock_bits=0x3F
# Build
splitter.build.mcu=atmega328p
splitter.build.f_cpu=8000000L
splitter.build.core=arduino:arduino
splitter.build.variant=arduino:standard